Table of Contents
 Class RebarHookBase
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents a base class for rebar hook in 3D.
public abstract class RebarHookBase : OpenObject
Inheritance
object
OpenObject
RebarHookBase
Derived
RebarHookBend
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 AxisY
Gets or sets the position (direction) of the hook in 3D. It representa a Local Coordinate System. Hook lie in X-Y Plane. AxisX is defined by first/last segment of the rebar. AxisX and AxisY creates a plane where the hook lies.
public Vector3D AxisY { get; set; }
Property Value
Vector3D
 Reverse
Reverse direction of the hook
public bool Reverse { get; set; }
Property Value
bool
 Edit this page